[
	{
		"title": "Fantastical",
		"client": "Fantastica Labs",
		"video": "FantasticalMontage.mp4",
		"gradient" : {
			"color1" : "#04138f",
			"color2" : "#09d5df",
			"angle" : "10"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Winter Wonderland",
				"body" : "Santa's Fantastical is an immersive holiday experience, featuring multiple interactive touchpoints and games. Experience everything from soaring auroras to virtual snowball fights."
			},
			{
				"title" : "Depth Sensing",
				"body" : "These experiences are built in Unity, and driven by Intel RealSense depth cameras. These cameras were used to track the silhouettes of guests and objects, translating the real world into particle systems and virtual physics objects."
			},
			{
				"title" : "Yeti Tracks",
				"body" : "Tracking small, white snowballs against a snowy landscape presented some unique challenges, especially when you add high velocity into the mix. Through multiple iterations of different tracking techniques, the experience achieved accuracy and reliability for over a dozen simultaneous guests."
			},
			{
				"title" : "Particles Galore",
				"body" : "Unity's visual effect graph drives the realtime effects in these experiences, allowing for beautiful visual landscapes of millions of particles with relatively low overhead."
			},
			{
				"title" : "Role",
				"body" : "I was the lead developer, handling the programming and realtime visual effects for the aurora, slide, and snowball fight experiences. I also worked on-site during testing and installation to ensure things got up and running smoothly."
			},
			{
				"title" : "Technologies",
				"body" : "Unity, Intel RealSense, OpenCV"
			}
		]
	},
	{
		"title": "Word Play",
		"client": "MODA",
		"video": "WordPlayMontage_01_720.mp4",
		"gradient" : {
			"color1" : "#3812A0",
			"color2" : "#AE236A",
			"angle" : "-18"
		},
		"articleColor" : "#545454",
		"articleContent" : [
			{
				"title" : "An Interactive Museum Exhibit",
				"body" : "Word Play was an interactive installation spanning a 40ft section of wall at the Museum of Design Atlanta. Visitors who walked through the center of the room were rewarded with the chance to fling ribbons of text across the gallery walls, streams of text acting as extensions of their hands. When idle, the blue text crawling slowly along the wall added colorful ambiance to the dim gallery.",
				"link" : {
					"title" : "View the project on primalscreen.com",
					"url" : "https://www.primalscreen.com/project/moda-wordplay"
				}
			},
			{
				"title" : "Text Me",
				"body" : "Featured in Text Me: How We Live in Language at the Museum of Design Atlanta, this installation was displayed alongside work by Stefan Sagmeister, Milton Glaser and Paula Scher, among others. It occupied an entire wall of a space devoted to interactive and video art, and was a popular point of engagement for kids and adults alike.",
				"link" : {
					"title" : "Details at museumofdesign.org",
					"url" : "https://www.museumofdesign.org/textme"
				}
			},
			{
				"title" : "Motion Controlled",
				"body" : "This project was developed in Unity, and a single Microsoft Kinect mounted at the center of the display drove the interactivity. Kinect’s excellent built in skeletal tracking and strong community support made development a breeze, allowing the team to prototype and deliver quickly."
			},
			{
				"title" : "Role",
				"body" : "I served as the lead developer, and handled all of the programming for this project. That included typical Unity scripting, interfacing with the Kinect SDK, building the Unity scene, and making some on-the-fly changes during installation. It was the first time I have had to write code while upside-down on a ladder, and hopefully the last."
			},
			{
				"title" : "Technologies",
				"body" : "Unity, Microsoft Kinect"
			}
		]
	},
	{
		"title": "Science",
		"client": "PBS Kids",
		"video": "ScienceAppMontage.mp4",
		"gradient" : {
			"color1" : "#00bde3",
			"color2" : "#22bb53",
			"angle" : "20"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Play and Learn",
				"body" : "The Play and Learn Science app is an exploration into the physical phenomena of our world for PBS Kids. It gives kids the opportunity to play with light and shadow, construct water walls, and control the weather with the guidance of classic PBS Kids characters.",
				"link" : {
					"title" : "Download the app",
					"url" : "https://pbskids.org/apps/play-and-learn-science-.html"
				}
			},
			{
				"title" : "Award Winning",
				"body" : "Beloved by kids, parents, and educators, this app received the prestigious Excellence in Early Learning Digital Media Award from the American Library Association."
			},
			{
				"title" : "Light and Water",
				"body" : "There is some fun technology underneath the 2D animated surface. Unique shaders simulate 2D shadows and generate metaballs for water. And speaking of water, creating satisfying fluid movement that runs smoothly on low end mobile devices presented it's own challenge."
			},
			{
				"title" : "Role",
				"body" : "I was the lead developer on this project, handling the majority of the programming and scene construction in Unity."
			},
			{
				"title" : "Technologies",
				"body" : "Unity, Adobe Animate"
			}
		]
	},
	{
		"title": "Street",
		"client": "Sesame Workshop",
		"video": "SesameMontage.mp4",
		"gradient" : {
			"color1" : "#980909",
			"color2" : "#ddd100",
			"angle" : "-18"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Making Muppets Dance",
				"body" : "I have had the pleasure of working on numerous educational games and activities for Sesame Street - everything from sending Elmo hurtling through space, to helping Oscar the Grouch muck up some tuxedos.",
				"link" : {
					"title" : "Play them all on sesamestreet.org",
					"url" : "https://www.sesamestreet.org/games"
				}
			},
			{
				"title" : "Web Games for All",
				"body" : "The goal of any Sesame Street game is to provide education and entertainment to all, which means not limiting access based on hardware or platform. All of these games are built for the web, and designed to provide the best experience even on older browsers and devices."
			},
			{
				"title" : "Endless Engines",
				"body" : "Over the years, technologies and production techniques have changed. These games have been built one a wide variety of platforms to match - numerous custom engines built on Flash, CreateJS, and PixiJS."
			}, 
			{
				"title" : "Role",
				"body" : "I have been the lead developer on many of these games and the frameworks behind them, including Super Salad Diner, Elmo's World Games, Show Me The Cookies, Pinball Number Count, The Cookie Games, Junk My Jacket, Big Bird's Basketball, Abby's Smoothie Maker, Comfy Cozy Nest, and Breathe Think Do. Additionally, I provided direction and support on several other games and activities."
			},
			{
				"title" : "Technologies",
				"body" : "CreateJS, PixiJS, Adobe Animate, Springroll, Unity"
			}
		]
	},
	{
		"title": "Adventure",
		"client": "Jim Henson",
		"video": "DinoTrainMontage.mp4",
		"gradient" : {
			"color1" : "#c7c602",
			"color2" : "#0dac20",
			"angle" : "8"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Dinosaurs and Trains",
				"body" : "Could there be a better combination of things? This set of web-based games for The Jim Henson Company follows the various adventures of Buddy the T-Rex",
				"link" : {
					"title" : "Play the games on pbskids.org",
					"url" : "https://pbskids.org/dinosaurtrain/games/"
				}
			},
			{
				"title" : "Highly Engaging",
				"body" : "Fun, sticky gameplay was the priority here, and it shows with high engagement rates on both the show's website and in the PBS Kids games app."
			},
			{
				"title" : "Role",
				"body" : "I was the lead developer on Buddy's Campout Adventure, and provided direction and support on both Dino Car Designer and Dino Flight"
			},
			{
				"title" : "Technologies",
				"body" : "CreateJS, PixiJS, Adobe Animate, Springroll"
			}
		]
	},
	{
		"title": "Spacehole",
		"client": "Furious Union",
		"video": "MegaSpacehole_720.mp4",
		"gradient" : {
			"color1" : "#c93600",
			"color2" : "#270091",
			"angle" : "-10"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Get Rekt!",
				"body" : "Mega Spacehole is a virtual reality arcade game, filled with dozens of blowing things up with your face - no controller needed.",
				"link" : {
					"title" : "Play the game on GearVR",
					"url" : "https://www.oculus.com/experiences/gear-vr/1056447741054271/"
				}
			},
			{
				"title" : "Early Adopters",
				"body" : "Released in early 2016 for Gear VR, this was developed in the early days of consumer virtual reality. Development kits and beta software were necessities, and this was one of a handful of titles released in the early days of the platform."
			},
			{
				"title" : "Around the World",
				"body" : "Licensing deals ensured that this game expanded beyond the GearVR, successfully deploying on platforms and markets across the Pacific."
			},
			{
				"title" : "Role",
				"body" : "I was the developer half of the two man team behind this. Developed on nights and weekends, it was an exhausting but rewarding labor of love."
			},
			{
				"title" : "Technologies",
				"body" : "Unity, Samsung GearVR"
			}
		]
	},
	{
		"title": "Village",
		"client": "Primal Screen",
		"video": "VRVillageMontage.mp4",
		"gradient" : {
			"color1" : "#181838",
			"color2" : "#7800dd",
			"angle" : "15"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "Virtual Vignettes",
				"body" : "VR Village is a small series of seasonal lands, developed alongside a custom-printed Cardboard VR viewer.",
				"link" : {
					"title" : "Download the app",
					"url" : "http://primal-scope.com/"
				}
			},
			{
				"title" : "Timely Delivery",
				"body" : "This project had multiple moving parts, from loxing down links and instructions on printed materials, to ensuring a successful app store deployment in time for the holidays. It was an effort that spanned multiple disciplines and mediums to pull off."
			},
			{
				"title" : "Lean Resources",
				"body" : "In addition to a tight timeline, this experience was designed to run smoothly across all mobile device categories. Everyone involved had to adopt guidelines for hitting maximum performance."
			},
			{
				"title" : "Role",
				"body" : "I was the lead developer behind both the Unity app and the webpage that hosted app links and instructions. I also worked closely with the 3D team to determine production pipelines and asset specs."
			},
			{
				"title" : "Technologies",
				"body" : "Unity, Google Cardboard"
			}
		]
	},
	{
		"title": "Ephemera",
		"client": "Personal Projects",
		"video": "PersonalProjectMontage.mp4",
		"gradient" : {
			"color1" : "#e217aa",
			"color2" : "#e6de16",
			"angle" : "-20"
		},
		"articleColor" : "#545454",
		"articleContent": [
			{
				"title" : "All the Small Things",
				"body" : "A collection of small projects, demos, and experiments, some of which are linked below. All of these projects were done on the side, for no client in particular, though some were presented to friends and coworkers for fun. "
			},
			{
				"title" : "Powderpuff",
				"body" : "A small generative art toy. Built directly with the 2D Canvas API, this project uses no third party libraries for tweening or rendering.",
				"link" : {
					"title" : "Play with the demo",
					"url" : "https://cyanletter.github.io/powderpuff/"
				}
			},
			{
				"title" : "Deep Dream",
				"body" : "An experiment applying neural network style transfer to video footage, the goal being to find combinations of style images and video that produced compelling results. As this was my first time working with neural networks of any kind, this used pretrained models and an open source style transfer implementation.", 
				"link" : {
					"title" : "Watch the video",
					"url" : "https://vimeo.com/288666945"
				}
			},
			{
				"title" : "Spoopy Woods",
				"body" : "A quick game demo, created in collaboration with an artist to test new technologies and workflows. Intended to showcase Spine animation, normal mapping on 2D sprites, and novel level design techniques. Not intended to perform well on low end devices.",
				"link" : {
					"title" : "Check out the project source",
					"url" : "https://github.com/CyanLetter/SpineJune"
				}
			},
			{
				"title" : "Flavor Mashup",
				"body" : "A silly website to create new and often vile food combinations, accompanied by a (now defunct) Twitter bot. There are many random generators, but this one is mine.",
				"link" : {
					"title" : "Make a mashup at flavormashup.com",
					"url" : "https://flavormashup.com/"
				}
			}
		]
	}
]